app/controllers/webcam_pictures_controller.rb

  def index
    @webcam_pictures = WebcamPicture.order("created_at DESC").all
---
SELECT "webcam_pictures".* FROM "webcam_pictures" ORDER BY created_at DESC

  def show
    @webcam_picture = WebcamPicture.find(params[:id])
---
SELECT "webcam_pictures".* FROM "webcam_pictures" WHERE "webcam_pictures"."id" = ? LIMIT 1  [["id", "4"]]

  def edit
    @webcam_picture = WebcamPicture.find(params[:id])
---
SELECT "webcam_pictures".* FROM "webcam_pictures" WHERE "webcam_pictures"."id" = ? LIMIT 1  [["id", "4"]]

  def create

    if params[:type] == "data"
      #we need to save this to a file and set the path in webcam_picture. It's posted as binary data in params image
      picsize = params[:image].length
      #logger.info("we got the data ;) size="+picsize.to_s )

      #create a new tempfile named fileupload
      tempfile = Tempfile.new("webcamupload")
      tempfile.binmode

      #get the file and decode it with base64 then write it to the tempfile
      tempfile.write( Base64.decode64( params[:image] ) )

      #create a new uploaded file
      uploaded_file = ActionDispatch::Http::UploadedFile.new(:tempfile => tempfile, :filename => "webcamupload.png", :original_filename => "webcamupload.png")

      @webcam_picture = WebcamPicture.new(params[:webcam_picture])
      @webcam_picture.snapshot = uploaded_file
      @webcam_picture.name = "live webcam shot!"

      if @webcam_picture.save
---
INSERT INTO "webcam_pictures" ("created_at", "name", "snapshot", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 09 May 2012 13:30:18 UTC +00:00], ["name", ""], ["snapshot", "Screenshot_from_2012-05-09_15_27_56.png"], ["updated_at", Wed, 09 May 2012 13:30:18 UTC +00:00]]

  def destroy
    @webcam_picture = WebcamPicture.find(params[:id])
    @webcam_picture.destroy
---
SELECT "webcam_pictures".* FROM "webcam_pictures" WHERE "webcam_pictures"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "webcam_pictures" WHERE "webcam_pictures"."id" = ?  [["id", 4]]